app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "effort", "job_id", "created_at", "updated_at", "complete", "hours") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Ali"], ["effort", 2], ["job_id", 5], ["created_at", "2019-02-19 04:57:21.924685"], ["updated_at", "2019-02-19 04:57:21.924685"], ["complete", "1"], ["hours", "14"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["complete", "1"], ["updated_at", "2019-02-19 04:57:50.704306"], ["id", 5]]